package com.gmail.muha.task6;

public class Main {
    public static void main(String[] args) {
        //Написать программу, которая выводит на экран первые четыре степени числа π.

        System.out.println("Пи в первой степени - " + Math.PI);
        System.out.println("Пи во второй степени - " + Math.pow(Math.PI, 2));
        System.out.println("Пи в третьей степени - " + Math.pow(Math.PI, 3));
        System.out.println("Пи в четвертой степени - " + Math.pow(Math.PI, 4));
    }
}
